{
	"paragraphs": [
		"I'm Jenny. I work as a full-stack software engineer with user experience research and design skills. I live in Cambridge (the American one) and work at <a href='http://www.dimagi.com'>Dimagi</a>, building technology for underserved communities.",
		"At Dimagi, I split my time between Android development for <a href='https://play.google.com/store/apps/details?id=org.commcare.dalvik&hl=en'>CommCare ODK</a> and Django and JavaScript development on <a href='http://www.commcarehq.org/'>CommCare HQ</a>. Before joining <a href='http://www.dimagi.com'>Dimagi</a>, I worked as a software engineer at <a href='http://www.athenahealth.com'>athenahealth</a> and at <a href='http://www.ebay.com'>eBay</a>.",
		"I experimented with being a designer but missed debugging too much and came back to software development. I hold a master's degree in human-computer interaction from <a href='http://www.cmu.edu'>Carnegie Mellon University</a> and a bachelor's degree in computer science from <a href='http://www.wpi.edu'>Worcester Polytechnic Institute</a>."
	],
	"projects": [
		{
			"name": "mLabour",
			"brief": "A mobile app for managing patient care in labor wards",
			"skills": ["Android", "sceniario testing"],
			"folder": "mlabour",
			"detail": "mLabour is an Android app for managing patient data during childbirth. The app includes a digitized version of the <a href='http://mnhtech.org/technology/technology-briefs/partograph/'>partograph</a>, a paper tool for tracking the mother's and baby's vitals. Beyond the electronic partograph, the app notifies staff when patients are overdue for an exam or have shown signs of being at risk for prolonged or obstructed labor.",
			"gallery": [
				{
					"name": "Case List",
					"image": "case_list.png",
					"width": 266,
					"height": 425,
					"detail": "The app summarizes each patient's demographics, historical risk likelihood, actual labor progression, and last examination time. It prioritizes patients based on these factors."
				},
				{
					"name": "Case Detail",
					"image": "case_detail.png",
					"width": 266,
					"height": 425,
					"detail": "Measurements recorded during labor, such as dilation, fetal heart rate, and contraction frequency and duration, are tracked on a digital partograph"
				},
				{
					"name": "Field Testing",
					"image": "field.jpg",
					"height": 418,
					"width": 557,
					"detail": "mLabour was built to facilitate a study of labor management at a hospital in Delhi. During the course of the project, I conducted scenario testing with hospital staff in classrooms using an early prototype and then field testing in the labor ward using the final version of the app."
				}
			]
		},
		{
			"name": "Graphing in CommCare",
			"brief": "Implementing data visualizations for frontline workers",
			"skills": ["Android"],
			"image": "growth_charts.png",
			"folder": "graphing",
			"detail": "I implemented graphing functionality in <a href='https://play.google.com/store/apps/details?id=org.commcare.dalvik&hl=en'>CommCare ODK</a>, an Android app used by frontline workers to manage their clients. One common use case was to support growth charts, enabling clinicians to more easily track patients' growth and monitor infants and toddlers for failure to thrive."
		},
		{
			"name": "Flavors",
			"brief": "Metadata-based music management",
			"skills": ["Perl", "SQL", "JavaScript", "LESS"],
			"folder": "flavors",
			"detail": "An interface to my music collection, Flavors organizes songs and collections based on personal metadata and uses this information to generate personally meaningful playlists.",
			"gallery": [
				{
					"name": "Collections",
					"image": "collections.png",
					"height": 259,
					"width": 500,
					"detail": "Songs are grouped into collections of albums or personal mixes."
				},
				{
					"name": "Categories",
					"image": "categories.png",
					"height": 301,
					"width": 500,
					"detail": "Flavors is based off of user-specific metadata, so it includes several pages that facilitate the input of this data, aiming to make the process less tedious."
				},
				{
					"name": "Lab",
					"image": "lab.png",
					"height": 279,
					"width": 500,
					"detail": "In the lab, playlists are generated based off of songs' similarity to an initial seed song. The user configures the definition of similarity: one might bump up the importance played by a song's energy level or by the mood it elicits."
				}
			]
		},
		{
			"name": "Workouts",
			"brief": "Tracking daily exercise",
			"skills": ["Ruby on Rails", "JavaScript", "CSS"],
			"image": "workouts.png",
			"folder": "workouts",
			"detail": "A project to track my running, rowing, and other activities. Gave me a reason to brush up on Rails and play with Flot."
		},
		{
			"name": "Flex Keyboard",
			"brief": "A simulated piano and sheet music editor",
			"skills": ["ActionScript"],
			"image": "keyboard.png",
			"folder": "keyboard",
			"detail": "A simulated piano and sheet music editor. Users can play freely using either mouse or keyboard and also record their music. Once recorded, songs can be played back, and the sheet music generated can be edited.",
			"links": [
				{
					"name": "demo",
					"url": "keyboard.swf"
				}
			]
		},
		{
			"name": "Processing",
			"brief": "Projects created using Processing",
			"skills": ["Processing", "Illustrator"],
			"detail": "Projects created using <a href='http://www.processing.org'>Processing</a>.",
			"folder": "processing",
			"gallery": [
				{
					"name": "Boston Marathon Visualization",
					"image": "applet.png",
					"height": 220,
					"width": 425,
					"detail": "A simulation of the 2009 Boston Marathon, illustrating how the pack of runners ebbed and flowed over the course of the race. Users can insert themselves into the race, seeing where they would have finished."
				},
				{
					"name": "Marathon Poster",
					"image": "poster.png",
					"height": 316,
					"width": 425,
					"detail": "A poster to motivate runners training for the <a href='http://www.thesfmarathon.com/'>San Francisco Marathon</a>. It displays a training plan, a sketch of the course, and sights along the way. A graph keeps track of total mileage run throughout the season, putting each week's long run in perspective."
				}
			],
			"links": [
				{
					"name": "Try marathon simulation applet",
					"url": "http://orangejenny.com/content/processing/applet/index.html"
				},
				{
					"name": "training poster",
					"url": "SFMPoster.pdf"
				},
				{
					"name": "Sources of photographs used in training poster",
					"url": "http://www.orangejenny.com/content/processing/poster_sources.html"
				}
			]
		},
		{
			"name": "You Win...Now What?",
			"brief": "Web game",
			"skills": ["JavaScript", "CSS"],
			"image": "game.png",
			"folder": "purplemonkeygamejam-feb-2014",
			"detail": "A  JavaScript-based game I put together in a weekend at the <a href='http://purplemonkeygamejam.com/'>Purple Monkey Game Jame</a>.",
			"links": [
				{
					"name": "demo",
					"url": "game.html"
				}
			]
		},
		{
			"name": "eBay: Developer Tools",
			"brief": "Projects to improve the developer experience of my team at eBay",
			"detail": "Projects to improve the developer experience of my team at eBay",
			"skills": ["PHP", "SQL", "JavaScript", "CSS"],
			"folder": "ebay_dev",
			"gallery": [
				{
					"name": "Workflows",
					"image": "workflow.png",
					"width": 425,
					"height": 425,
					"detail": "The workflow system I created to move intensive web-initiated tasks offline. Each workflow is broken into small, reusable steps. Email notifications keep users up to date on the status of their workflows. Initially, tasks were executed sequentially by a batch job; later, the back-end was integrated with another tool in order to run jobs in parallel. I was responsible for every aspect of this system, which dramatically reduced page load times and browser crashes."
				},
				{
					"name": "Queue Manager: System Status",
					"image": "status.png",
					"width": 425,
					"height": 425,
					"detail": "The queue manager is a system that distributes and manages thousands of jobs daily across a pool of worker machines. Redesigning the interface lessened the development team's support load and enabled involvement of a remote support team."
				},
				{
					"name": "Queue Manager: Batch Detail",
					"image": "batch.png",
					"width": 425,
					"height": 282,
					"detail": "Another area of the queue manager, details of a single batch: job dependencies, batch-level commands, and job-level commands."
				}
			]
		},
		{
			"name": "eBay: Product",
			"brief": "Feature development for eBay's Internet Marketing Solutions team",
			"skills": ["PHP", "SQL", "JavaScript", "CSS"],
			"folder": "ebay_product",
			"detail": "I worked with Internet Marketing Solutions for three years, largely on feature development for the company's ad optimization platform.",
			"gallery": [
				{
					"name": "Legal Portal",
					"image": "legal_portal.png",
					"height": 337,
					"width": 500,
					"detail": "The legal portal, a tool to tailor an internet marketing application to the needs of the corporate legal team. It enables the legal team to track sensitive keywords and remove them from the live keyword portfolios if necessary, overriding the usual business processes and queueing mechanisms."
				},
				{
					"name": "Keyword Dashboard",
					"image": "dashboard.png",
					"width": 500,
					"height": 500,
					"detail": "The keyword dashbaord, an interface for internet marketing analysts to investigate interesting keywords. Thousands of keywords are marked as 'interesting' each day by a static query; the dashboard lets users sift through those keywords in a variety of ways and then take action on individual keywords. I designed and implemented the interface, while another team member wrote the scripts to choose and store relevant keywords."
				}
			]
		},
		{
			"name": "Mobile design",
			"skills": ["Interaction design", "Experience prototyping", "Illustrator"],
			"brief": "Research and design for mobile phone apps.",
			"detail": "Research and design for mobile phone apps.",
			"folder": "mobile_design",
			"gallery": [
				{
					"name": "Tiramisu: Trip Details",
					"image": "tiramisu/screen05.png",
					"height": 343,
					"width": 425,
					"detail": "Tiramisu, a mobile application that acts as a citizen-powered automatic vehicle location system. I worked on one of several teams designing the interaction for different variations of this system. The application has since been released for the iPhone. The default view displays the user's current location and nearby bus stops. Once a user gets on a bus, the app asks how full the bus is, so it can warn waiting users if they might be passed by an overly full bus. After boarding the bus and providing fullness information, the user can leave the app on and allow it to periodically transmit their location to the central server. To encourage users to keep it open, the app contains an alarm that will notify the user just before arrival."
				},
				{
					"name": "FoodForward: Wireframes",
					"detail": "FoodForward, a mobile app to facilitate healthy food choices and strengthen family connections. FoodForward helps users select foods, accounting for nutrition, individual health conditions, environmental concerns, and personal preference. Design was driven in part by the creation of a persona and relevant scenarios of her day. Early wireframes of the main screens.",
					"image": "food_forward/wireframes.png"
				}
			],
			"links": [
				{
					"name": "Tiramisu: the real-time bus tracker",
					"url": "http://www.tiramisutransit.com"
				},
				{
					"name": "FoodForward project site",
					"url": "http://orangejenny.com/content/mobile_design/food_forward/site/index.php"
				}
			]
		},
		{
			"name": "Site design",
			"skills": ["Python", "SQL", "CSS", "JavaScript", "Illustrator", "Interaction design", "Contextual design", "Usability testing"],
			"brief": "Research and design for desktop-based sites.",
			"detail": "Projects completed as part of my master's in human-computer interaction. These focused on user research, information architecture, and wireframing, although one also included building a Python-based, MySQL-backed prototype.",
			"folder": "site_design",
			"gallery": [
				{
					"name": "AIR Homepage",
					"image": "air/homepage.png",
					"height": 417,
					"width": 363,
					"detail": "A seven-month project to redesign the website of the <a href='http://www.air.org/'>American Institutes for Research</a> (AIR), with a semester of user research followed by a semester of design and prototyping. This was a team of four, with me acting as technical lead. Our new information architecture simplified the site's structure, moving from two main navigation menus to one and eliminating duplicate content that plagued the original site. The homepage of our final design centers on a tabbed pane introducing AIR's five focus areas. It also features recent content and a rotating employee."
				},
				{
					"name": "Soir&eactue;e: Cooking",
					"image": "soiree/screen03.png",
					"height": 379,
					"width": 425,
					"detail": "Soir&eacute;e is a design for an online meal preparation tool to help chefs at any experience level execute a complex event. The front page of Soir&eacute;e outlines the 3-step process&mdash;select, prepare, and cook&mdash;and displays a few mouthwatering recipe ideas. To support the actual cooking, Soir&eacute;e generates a Gantt-style chart outlining which steps to take when, accounting for the available equipment, the user's skills, and the final meal time."
				}
			],
			"links" : [
				{
					"name" : "AIR project site",
					"url" : "http://www.orangejenny.com/content/site_design/air/site"
				},
				{
					"name": "Soiree project site",
					"url": "http://www.orangejenny.com/content/site_design/soiree/site"
				}
			]
		},
		{
			"name": "Print Design",
			"brief": "Assorted print design pieces",
			"detail": "Assorted print design pieces, created with Illutrator, InDesign, and Photoshop.",
			"skills": ["Illustrator", "InDesign", "PhotoShop"],
			"folder": "info_design",
			"gallery": [
				{
					"name": "Invertebrate Zoology",
					"image": "iz_poster.png",
					"width": 425,
					"height": 275,
					"detail": "A poster to attract attention for the Invertebrate Zoology Department at the Carnegie Museum of Natural History."
				},
				{
					"name": "The Aeron",
					"image": "aeron.jpg",
					"width": 328,
					"width": 425,
					"detail": "A brochure to advertise the Aeron office chair."
				},
				{
					"name": "Minestrone Soup",
					"image": "recipe.jpg",
					"width": 366,
					"width": 425,
					"detail": "A soup recipe."
				}
			]
		},
		{
			"name": "Front Loader Bed",
			"brief": "A foray into woodworking",
			"skills": ["Carpentry"],
			"detail": "I dabbled in carpentry for a time, building a bed shaped like a front loader. I began with a set of blueprints intended for a child's bed, and adjusted them to raise the roof so that I would be able to sit up in bed, while minimizing the required materials.",
			"folder": "bed",
			"links": [
				{
					"name": "Plans4Wood",
					"url": "http://www.plans4wood.com"
				}
			],
			"gallery": [
				{
					"name": "Model",
					"image": "model.jpg",
					"height": 180,
					"width": 213,
					"detail": "A model of the bed after re-scaling for an adult."
				},
				{
					"name": "Supplies",
					"image": "materials.jpg",
					"width": 217,
					"height": 319,
					"detail": "Raw materials: four sheets of birch, one sheet of plywood, and a 2 x 4."
				},
				{
					"name": "Details",
					"image": "detail_pieces.jpg",
					"height": 155,
					"width": 319,
					"detail": "The roof and assorted decorative pieces."
				},
				{
					"name": "Final Assembly",
					"image": "three_quarters_done.jpg",
					"width": 213,
					"height": 164,
					"detail": "The bed would be too large to fit through a doorway, so I had to build it in the room where it would stay. Unfortunately, this also meant dismantling it when I moved out."
				},
				{
					"name": "Front Half",
					"image": "front_end.jpg",
					"width": 213,
					"height": 169,
					"detail": "Completed front end and scoop."
				},
				{
					"name": "Finished",
					"image": "finished.jpg",
					"width": 199,
					"width": 213,
					"detail": "Finished!"
				}
			]
		}
	]
}
