{"solution" : [{"name" : "summary",
			"left" : "Parley is a public interactive system designed to initiate and mediate conversations, located in Pittsburgh's Oakland neighborhood, behind the Stephen Foster Monument.<br /><br />Parley delineates &quot;conversation spaces&quot; on an interactive floor, with discrete cells of color actively reflecting the spatial location of each participant. This arrangement of spaces is modeled after the Voronoi method of decomposing a planar space.<br /><br />A large, central interactive cylinder allows users to investigate topics of conversation, populated from geographically proximate data from online social networks and news websites. A mobile phone application optionally links users' online profile information to the system to allow them to leverage their online data for topic selection. Parley also generates conversation topics from on-the-fly SMS messages.<br /><br /><a href='Parley.pdf'>Download final presentation (PDF)</a>",
			"right" : "<img src='images/summary.png' style='margin-top:145px;' />"},
			{"name" : "personalization",
			"left" : "Parley generates conversation topics based on:<ul><li>current news</li><li>user profile information</li><li>topics sent to the system via SMS or Twitter</li></ul>All users see topics based on current events.<br /><br />Users carrying a bluetooth-enabled mobile device may choose to allow Parley to access specific online profiles such as their Flickr account or a personal blog. Parley will parse these profile for topics likely to interest the user.<br /><br />Any user can also send a specific topic of interest to Parley via SMS.<br /><br /><a href='Personalization.pdf'>Download personalization model (PDF)</a>",
			"right" : "<img src='images/personalization.png' />"},
			{"name" : "interaction",
			"left" : "Parley uses several of <a href='http://portal.acm.org/citation.cfm?id=1518701.1518920'>Snibbe and Raffle's</a> best practices for socially immersive media.<br /><br />The installation is <span style='font-weight:bold;'>visceral and responsive</span>, reacting to body movements and physical proximity between users. Its output is <span style='font-weight:bold;'>continuously variable</span>, with the floor's conversation spaces shifting instantly to reflect user movement and forming an infinite variety of patterns.<br /><br />The user experience is <span style='font-weight:bold;'>socially scalable</span>, growing richer as more people join and converse. It is also <span style='font-weight:bold;'>socially familiar</span>, reinforcing existing conversational behavior. Lastly, Parley is <span style='font-weight:bold;'>socially balanced</span>: participants interact with the installation, with other participants, and also increase their self-awareness.",
			"right" : "<img src='images/interaction.png' />"},
			{"name" : "video",
			"left" : "A video sketch illustrates Parley.",
			"right" : "<object width='480' height='360'><param name='allowfullscreen' value='true' /><param name='allowscriptaccess' value='always' /><param name='movie' value='http://vimeo.com/moogaloop.swf?clip_id=11633778&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=&amp;fullscreen=1' /><embed src='http://vimeo.com/moogaloop.swf?clip_id=11633778&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=&amp;fullscreen=1' type='application/x-shockwave-flash' allowfullscreen='true' allowscriptaccess='always' width='480' height='360'></embed></object><br /><br /><a href='http://vimeo.com/11633778'>Activating Public Landscapes: Parley</a> from <a href='http://vimeo.com/user3294904'>jesse v</a> on <a href='http://vimeo.com'>Vimeo</a>."}],
"design" : [{"name" : "storyboards",
			"left" : "We sketched a storyboard for an early version of Parley, which combined facets of several of our earlier ideas.<br /><br />The storyboard makes use of the following scenario:<br /><br />Chad has some time before his bus arrives. He approaches the center of the installation's square and notices a yellow shape underneath him, following his movements. Chad notices another person in the square with a yellow-colored shape, indicating the two have something in common. Chad and the stranger strike up conversation.",
			"right" : "<img src='images/storyboards.png' />"},
			{"name" : "validation",
			"left" : "We used the storyboards for <a href='http://www.slideshare.net/scott.davidoff/how-to-use-speed-dating-for-design'>speed dating</a>, validating our ideas with potential participants. We asked participants:<ul><li>Have you ever wanted to broadcast your availability for conversation?</li><li>Have you ever wanted to strike up a conversation with someone, but didn’t know how to start?</li></ul>Participants were receptive to this kind of interaction with strangers: &quot;Striking up a conversation is difficult&mdash;it’s not a problem of finding a topic, but more a question of the other person’s personality and willingness.&quot; Privacy concerns also came up during speed dating, particularly regarding exploring current events in public.",
			"right" : "<img src='images/validation.png' />"}],
"synthesis" : [{"name" : "needs",
			"left" : "Based on our observations and discussions with potential users, we developed three primary needs for our installation to address, relating to emotional, functional, and social areas.<br /><br />Participants were open to interacting with strangers to alleviate boredom, especially if the conversations had potential to be more topical and meaningful than small talk. Participants commented on feeling inhibited by social norms, being uncertain how to know if another person was open to conversation and how to indicate that they themselves were open to conversation.<br /><br />Despite their desire to interact with other people, some individuals were unwilling to approach others without some kind of mediator. This mediating force might be a shared interest, found through common taste in music or books, something noteworthy in the environment (such as the weater), or even an accidental bumping into one another.",
			"right" : "<img src='images/needs.png' />"},
			{"name" : "ideation 1",
			"left" : "At the culmination of our brainstorming and development of needs, we sketched over 20 separate concepts for consideration as public installation pieces. We solicited further feedback for each of these ideas and narrowed the list to the five most interesting and impactful one with regards to the needs we had previously identified. These five ideas included: <ul><li><span style='font-weight:bold;'>BeatMap</span>, a large, interactive sound board that would enable users to act as DJs mixing the sounds of ambient street noise from different neighborhoods.</li><li><span style='font-weight:bold;'>Crossroads</span>, a pyramid-shaped visualization that would stream video feeds from disparate neighborhoods to bring activity into Morrow Triangle and help newcomers learn about Pittsburgh's diverse communities.</li><li><span style='font-weight:bold;'>Hello, It's Me</span>, where passersby would see faces projected onto their shadows&mdash;faces of other participants in the installation</li></ul><a href='5Concepts.pdf'>Download presentation of 5 concepts (PDF)</a>",
			"right" : "<img src='images/ideation1.png' />"},
			{"name" : "ideation 2",
			"left" : "At the culmination of our brainstorming and development of needs, we sketched over 20 separate concepts for consideration as public installation pieces. We solicited further feedback for each of these ideas and narrowed the list to the five most interesting and impactful one with regards to the needs we had previously identified. These five ideas included: <ul><li><span style='font-weight:bold;'>Smile Mile</span>, an interactive display and collection of sensors that would use computer vision to observe smiling passersby and create visualizations of a location's &quot;mood.&quot;</li><li><span style='font-weight:bold;'>Sweet Seat</span>, a cluster of seating areas that would &quot;match up&quot; participants based on common interests listed in their online profiles. Sweet Seat would indicate to participants who they matched with but would leave it to them to determine exactly what it was they had in common, leveraging ambiguity to make the installation more engaging.</li></ul><a href='5Concepts.pdf'>Download presentation of 5 concepts (PDF)</a>",
			"right" : "<img src='images/ideation2.png' />"}],
"research" : [{"name" : "territory",
			"left" : "In an effort to define our initial problem space, we brainstormed as a team areas of interest relating to location, activity, emotions, and interaction goals. In doing so, we shared ideas that were personally relevant to us and that we saw as opportunities where a public interactive piece could have impact. Prominent themes in our discussion included urban alienation, loneliness, and also the goal of bringing people together.",
			"right" : "<img src='images/territory.png'/>"},
			{"name" : "inspiration",
			"left" : "Several social media projects inspired our early ideas.<ul><li><a href='http://web.media.mit.edu/~nvawter/thesis/index.html'>Ambient Addition</a> listens to noise in the environment and adds a layer of music to complement the existing sounds.</li><li><a href='http://snibbe.com/scott/bf/'>Boundary Functions</a> uses an interactive floor to marks each participant's personal space, which changes as people move around the installation. This piece was especially influential in our final concept, inspiring our &quot;conversation spaces&quot; that adapt to individuals' movement in the space.</li><li><a href='http://eco.media.mit.edu/proximeter'>Proximeter</a> displays glanceable information about a user's online social networks with the goal of encouraging face-to-face interaction.</li><li><a href='http://www.lozano-hemmer.com/under_scan.php'>Under Scan</a> detects people walking through a public space and projects images into their shadows as a form of public spectacle.</li></ul>",
			"right" : "<img src='images/inspiration.png' />"},
			{"name" : "target: morrow triangle",
			"left" : "<span style='font-weight:bold;'>Methods:</span> Activity Observation | On-Site Interviews | Urban Archeology<br /><br />We researched two sites in Pittsburgh as potential places for our installation. The first was Morrow Triangle, a small patch of grass at the intersection of three different neighborhoods and several busy roads. Morrow Triangle is the site of a monument to WWII soldiers and sits in a busy location, bordered by a church, a hotel, and numerous storefronts and apartments.<br /><br />We interviewed people walking by the triangle, who said the space had little activity but felt it had potential to serve the community in more beneficial ways, given its visibility and location as the crux of three neighborhoods. One interviewee, a newcomer to the Pittsburgh, desired an installation that would acquaint him with the city. Another, who worked at the church next to the triangle, considered the triangle an ideal location to encourage reflection, particularly for hotel guests, many of whom are visiting patients in nearby Shadyside Hospital.",
			"right" : "<img src='images/morrow.png' />"},
			{"name" : "target: s. foster memorial",
			"left" : "<span style='font-weight:bold;'>Methods:</span> Activity Observation | On-Site Interviews | Urban Archeology<br /><br />The second site we examined in Pittsburgh was an area on Forbes Avenue by the Stephen Foster Monument. This area receives a high volume of foot traffic. It touches the University of Pittsburgh's campus and is near Carnegie Mellon University's campus, so students pass by continually. It sits between popular Schenley Park, the Carnegie Museum of Natural History, and the main city library. Sidewalks crisscross the ground, and several benches are provided. It is located next to two busy bus stops.<br /><br />We interviewed two men in the area at length. One expressed a strong desire to interact more with others in public, particularly conversations that he could learn from. For example, he wished for a way to broadcast the name of the last book he read and to signal his desire to talk about it. The second interviewee was more hesitant to strike up conversations with strangers but expressed interest in doing so if some kind of mediator existed, some third object.",
			"right" : "<img src='images/oakland.png' />"}]}